{"config": {"name": "custom_net", "input_layers": [["input_8", 0, 0]], "output_layers": [["fc", 0, 0]], "layers": [{"name": "input_8", "inbound_nodes": [], "config": {"dtype": "float32", "name": "input_8", "sparse": false, "batch_input_shape": [null, 28, 28, 1]}, "class_name": "InputLayer"}, {"name": "conv1", "inbound_nodes": [[["input_8", 0, 0, {}]]], "config": {"filters": 5, "kernel_regularizer": null, "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "name": "conv1", "strides": [5, 5], "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "activation_15", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pool1", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"name": "max_pool1", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "conv2", "inbound_nodes": [[["max_pool1", 0, 0, {}]]], "config": {"filters": 10, "kernel_regularizer": null, "kernel_size": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "data_format": "channels_last", "name": "conv2", "strides": [2, 2], "activation": "linear", "activity_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Conv2D"}, {"name": "activation_16", "inbound_nodes": [[["conv2", 0, 0, {}]]], "config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"name": "max_pool2", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"name": "max_pool2", "strides": [1, 1], "pool_size": [2, 2], "padding": "valid", "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"name": "flatten_8", "inbound_nodes": [[["max_pool2", 0, 0, {}]]], "config": {"name": "flatten_8", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"name": "fc", "inbound_nodes": [[["flatten_8", 0, 0, {}]]], "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "name": "fc", "activation": "softmax", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "units": 24, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Model"}